# Question 1

In [4]:
'''
1) How-to-count-distance-to-the-previous-zero
For each value, count the difference back to the previous zero (or the start of the Series,
whichever is closer)
create a new column 'Y' =[1,2,0,1,2,3,4,0,1,2]
'''
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [12]:
x = (df['X'] != 0).cumsum()

In [13]:
x

0    1
1    2
2    2
3    3
4    4
5    5
6    6
7    6
8    7
9    8
Name: X, dtype: int32

In [25]:
x.shift()

0    NaN
1    1.0
2    2.0
3    2.0
4    3.0
5    4.0
6    5.0
7    6.0
8    6.0
9    7.0
Name: X, dtype: float64

In [18]:
y = x != x.shift()
y

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8     True
9     True
Name: X, dtype: bool

In [26]:
y.shift()

0      NaN
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9     True
Name: X, dtype: object

In [27]:
y != y.shift()

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7     True
8     True
9    False
Name: X, dtype: bool

In [28]:
y != y.shift().cumsum()

0     True
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
Name: X, dtype: bool

In [44]:
y[y != y.shift().cumsum()]

0     True
2    False
3     True
4     True
5     True
6     True
7    False
8     True
9     True
Name: X, dtype: bool

In [46]:
 Y = y.groupby((y != y.shift()).cumsum()).cumsum()

In [47]:
type(Y)

pandas.core.series.Series

In [52]:
df['Y'] = Y.astype(int)

# Output - Column Y contains - for each value, count the difference back to the previous zero

In [53]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

# Question 2

In [87]:
'''
2) Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.
'''
#Return a fixed frequency datetime index, with business day as the default
import numpy as np
from datetime import datetime
start = datetime(2011, 1, 1)
end = datetime(2012, 1, 1)
rng = pd.bdate_range(start,end, freq='B')

In [89]:
rng

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14',
               ...
               '2011-12-19', '2011-12-20', '2011-12-21', '2011-12-22',
               '2011-12-23', '2011-12-26', '2011-12-27', '2011-12-28',
               '2011-12-29', '2011-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')

In [90]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [91]:
ts.head()

2011-01-03   -0.530358
2011-01-04   -0.306445
2011-01-05   -1.203348
2011-01-06    0.634929
2011-01-07   -1.555432
Freq: B, dtype: float64

In [92]:
ts.shape

(260,)

# Output - DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers

In [152]:
type(ts)

pandas.core.series.Series

In [93]:
ts.index[:5]

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07'],
              dtype='datetime64[ns]', freq='B')

# Question 3

In [94]:
'''
3) Find the sum of the values in s for every Wednesday
'''

'\n3) Find the sum of the values in s for every Wednesday\n'

In [95]:
s = pd.DataFrame(ts,columns=['Value'])

In [96]:
s.head()

               Value
2011-01-03 -0.530358
2011-01-04 -0.306445
2011-01-05 -1.203348
2011-01-06  0.634929
2011-01-07 -1.555432

In [97]:
s = s.reset_index()

In [98]:
s = s.rename(columns={'index':'Date'})

In [99]:
s.head()

        Date     Value
0 2011-01-03 -0.530358
1 2011-01-04 -0.306445
2 2011-01-05 -1.203348
3 2011-01-06  0.634929
4 2011-01-07 -1.555432

In [100]:
s['Week_Day'] = pd.to_datetime(s['Date']).dt.weekday

In [101]:
s.tail()

          Date     Value  Week_Day
255 2011-12-26 -1.409116         0
256 2011-12-27 -0.957198         1
257 2011-12-28 -1.408459         2
258 2011-12-29  0.162496         3
259 2011-12-30  0.549287         4

# Output - sum of the values in s for every Wednesday

In [104]:
s[s['Week_Day']== 2]['Value'].sum()

-5.181852347266582

# Question - 4

In [107]:
'''
4) Average For each calendar month
'''

s['Month'] = pd.to_datetime(s['Date']).dt.month
s.tail()

          Date     Value  Week_Day  Month
255 2011-12-26 -1.409116         0     12
256 2011-12-27 -0.957198         1     12
257 2011-12-28 -1.408459         2     12
258 2011-12-29  0.162496         3     12
259 2011-12-30  0.549287         4     12

# Output - Average of value for each calendar month

In [110]:
s.groupby('Month')['Month','Value'].mean()

       Month     Value
Month
1          1 -0.094279
2          2 -0.215843
3          3 -0.081127
4          4  0.040848
5          5 -0.060454
6          6  0.213436
7          7 -0.034076
8          8  0.191678
9          9  0.007992
10        10 -0.192960
11        11  0.009323
12        12 -0.438356

# Question 5

In [113]:
'''
For each group of four consecutive calendar months in s, find the date on which the
highest value occurred.
'''
s['Quarter_of_year'] = pd.to_datetime(s['Date']).dt.quarter
s.tail()

          Date     Value  Week_Day  Month  Quarter_of_year
255 2011-12-26 -1.409116         0     12                4
256 2011-12-27 -0.957198         1     12                4
257 2011-12-28 -1.408459         2     12                4
258 2011-12-29  0.162496         3     12                4
259 2011-12-30  0.549287         4     12                4

In [114]:
s['Quarter_of_year'].unique()

array([1, 2, 3, 4], dtype=int64)

In [140]:
s.groupby('Quarter_of_year')['Value'].max()

Quarter_of_year
1    2.186379
2    2.225278
3    2.079568
4    1.841715
Name: Value, dtype: float64

In [127]:
val  = (s.groupby('Quarter_of_year')['Value'].max()).tolist()

In [128]:
val

[2.1863789673296607,
 2.2252783305280666,
 2.0795678399642785,
 1.8417147495332016]

In [150]:
df = s[(s['Value'] == val[0]) | (s['Value'] == val[1])| (s['Value'] == val[2]) | (s['Value'] == val[3])].drop(['Week_Day','Month'],axis=1)

# Output - For each group of four consecutive calendar months in s, find the date on which the highest value occurred

In [151]:
df

          Date     Value  Quarter_of_year
29  2011-02-11  2.186379                1
66  2011-04-05  2.225278                2
140 2011-07-18  2.079568                3
222 2011-11-09  1.841715                4